STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_menu_cfg.c
  select_broadcast_action.ActionType = MENU_ACTION_LIST_CALLBACK;
  select_broadcast_action.pIcon = &access_menu_icon;
  select_broadcast_action.ListCallback = &Menu_SelectBroadcast;

  Menu_Init();

  p_stlogo_menu = Menu_CreatePage(MENU_TYPE_LOGO);
  p_startup_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_csip_config_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_waitcon_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_connecting_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_nostream_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_streaming_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_control_menu = Menu_CreatePage(MENU_TYPE_LIST);
  p_volume_control_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_call_control_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_media_control_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_config_menu = Menu_CreatePage(MENU_TYPE_LIST);
  p_broadcast_scan_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_broadcast_list_menu = Menu_CreatePage(MENU_TYPE_LIST);
  p_pa_sync_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_bis_sync_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_broadcast_synced_menu = Menu_CreatePage(MENU_TYPE_CONTROL);
  p_broadcast_menu = Menu_CreatePage(MENU_TYPE_LIST);

  csip_config_action.pPage = (struct Menu_Page_t*) p_csip_config_menu;
  start_advertising_action.pPage = (struct Menu_Page_t*) p_waitcon_menu;
  start_broadcast_scan_action.pPage = (struct Menu_Page_t*) p_broadcast_scan_menu;
  access_config_menu_action.pPage = (struct Menu_Page_t*) p_config_menu;
  access_menu_action.pPage = (struct Menu_Page_t*) p_control_menu;
  broadcast_menu_action.pPage = (struct Menu_Page_t*) p_broadcast_menu;
  entry_menu_volume_action.pPage = (struct Menu_Page_t*) p_volume_control_menu;
  entry_menu_call_action.pPage = (struct Menu_Page_t*) p_call_control_menu;
  entry_menu_media_action.pPage = (struct Menu_Page_t*) p_media_control_menu;

  Menu_SetControlContent(p_startup_menu, &startup_text, &stlogo_icon);
  Menu_SetControlAction(p_startup_menu, MENU_DIRECTION_RIGHT, access_config_menu_action);

  Menu_SetControlContent(p_csip_config_menu, &csip_config_text, 0);
  Menu_SetControlAction(p_csip_config_menu, MENU_DIRECTION_UP, csip_config_up_action);
  Menu_SetControlAction(p_csip_config_menu, MENU_DIRECTION_DOWN, csip_config_down_action);

  Menu_SetControlContent(p_waitcon_menu, &waitcon_text, &advertising_icon);
  Menu_SetControlAction(p_waitcon_menu, MENU_DIRECTION_LEFT, stop_advertising_action);

  Menu_SetControlContent(p_broadcast_scan_menu, &broadcast_scan_text, &advertising_icon);
  Menu_SetControlAction(p_broadcast_scan_menu, MENU_DIRECTION_LEFT, stop_advertising_action);

  Menu_SetControlContent(p_connecting_menu, &connecting_text, &hourglass_icon);

  Menu_SetControlContent(p_nostream_menu, &nostream_text, 0);
  Menu_SetControlAction(p_nostream_menu, MENU_DIRECTION_RIGHT, access_menu_action);

  Menu_SetControlContent(p_streaming_menu, &streaming_text, 0);
  Menu_SetControlAction(p_streaming_menu, MENU_DIRECTION_RIGHT, access_menu_action);

  Menu_SetLogo(p_stlogo_menu, &homelogo_icon);

  Menu_AddListEntry(p_control_menu, "Volume...", entry_menu_volume_action);
  Menu_AddListEntry(p_control_menu, "Call...", entry_menu_call_action);
  Menu_AddListEntry(p_control_menu, "Media...", entry_menu_media_action);
  Menu_AddListEntry(p_control_menu, "Disconnect", entry_menu_disconnect_action);

  Menu_AddListEntry(p_config_menu, "Start Unicast", start_advertising_action);
  Menu_AddListEntry(p_config_menu, "Start Broadcast", start_broadcast_scan_action);
  Menu_AddListEntry(p_config_menu, "Audio Config", csip_config_action);
  Menu_AddListEntry(p_config_menu, "Clear Sec. DB", clear_db_action);

  Menu_SetControlContent(p_volume_control_menu, &volume_text, 0);
  Menu_SetControlAction(p_volume_control_menu, MENU_DIRECTION_UP, volume_control_up_action);
  Menu_SetControlAction(p_volume_control_menu, MENU_DIRECTION_DOWN, volume_control_down_action);
  Menu_SetControlAction(p_volume_control_menu, MENU_DIRECTION_RIGHT, volume_control_right_action);

  Menu_SetControlContent(p_call_control_menu,&call_text, 0);
  Menu_SetControlAction(p_call_control_menu, MENU_DIRECTION_UP, call_control_up_action);
  Menu_SetControlAction(p_call_control_menu, MENU_DIRECTION_DOWN, call_control_down_action);

  Menu_SetControlContent(p_media_control_menu, &media_text, 0);
  Menu_SetControlAction(p_media_control_menu, MENU_DIRECTION_UP, media_control_up_action);
  Menu_SetControlAction(p_media_control_menu, MENU_DIRECTION_DOWN, media_control_down_action);
  Menu_SetControlAction(p_media_control_menu, MENU_DIRECTION_RIGHT, media_control_right_action);

  Menu_AddListEntry(p_broadcast_menu, "Volume...", entry_menu_volume_action);
  Menu_AddListEntry(p_broadcast_menu, "Stop Sink", stop_broadcast_sync_action);

  Menu_SetControlContent(p_broadcast_scan_menu, &broadcast_scan_text, &advertising_icon);
  Menu_SetControlAction(p_broadcast_scan_menu, MENU_DIRECTION_LEFT, stop_broadcast_scan_action);
  Menu_SetControlContent(p_pa_sync_menu, &pa_sync_text, &hourglass_icon);
  Menu_SetControlContent(p_bis_sync_menu, &bis_sync_text, &hourglass_icon);
  Menu_SetControlContent(p_broadcast_synced_menu, &broadcast_synced_text, 0);
  Menu_SetControlAction(p_broadcast_synced_menu, MENU_DIRECTION_RIGHT, broadcast_menu_action);


  Menu_SetControlAction(p_broadcast_list_menu, MENU_DIRECTION_LEFT, stop_broadcast_scan_action);

#if (CFG_JOYSTICK_SUPPORTED == 1)
  Menu_SetActivePage(p_stlogo_menu);
  UTIL_TIMER_Create(&Startup_Timer, STARTUP_TIMEOUT, UTIL_TIMER_ONESHOT, &Menu_Startup_TimerCallback, 0);
  UTIL_TIMER_Start(&Startup_Timer);
#else /*(CFG_JOYSTICK_SUPPORTED == 1)*/
  TMAPAPP_Init(0);
  uint8_t status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_HEADPHONES);
  LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
  Menu_SetActivePage(p_waitcon_menu);
#endif /*(CFG_JOYSTICK_SUPPORTED == 1)*/
}

/**
 * @brief Set the connecting page as active
 */
void Menu_SetConnectingPage(void)
{
  Menu_SetActivePage(p_connecting_menu);
  UTIL_TIMER_Stop(&Advertising_Timer);
}

/**
 * @brief Set the NoStream Page as active
 */
void Menu_SetNoStreamPage(void)
{
  Menu_SetActivePage(p_nostream_menu);
}

/**
 * @brief Set the Streaming page as active
 * @param pSamplerateText: Samplerate string of the stream
 * @param AudioRole: Audio Role of the stream
 */
void Menu_SetStreamingPage(char* pSamplerateText, Audio_Role_t AudioRole)
{
  snprintf(&streaming_text.Lines[0][0], MENU_CONTROL_MAX_LINE_LEN, "Streaming %s", pSamplerateText);
  if (AudioRole == AUDIO_ROLE_SINK)
  {
    p_streaming_menu->pIcon = &input_icon;
  }
  else if (AudioRole == AUDIO_ROLE_SOURCE)
  {
    p_streaming_menu->pIcon = &output_icon;
  }
  else
  {
    p_streaming_menu->pIcon = &input_output_icon;
  }
  Menu_SetActivePage(p_streaming_menu);
}

/**
 * @brief Set the WaitConnection Page as active
 */
void Menu_SetWaitConnPage(void)
{
  Menu_SetActivePage(p_waitcon_menu);
}

/**
 * @brief Set the Startup Page as active
 */
void Menu_SetStartupPage(void)
{
  Menu_SetActivePage(p_startup_menu);
}

/**
 * @brief Set the 4 characters Device Identifier
 */
void Menu_SetIdentifier(char *pId)
{
  UTIL_MEM_cpy_8(&waitcon_text.Lines[1][9], pId, 4);
}

/**
 * @brief Set Current volume value
 */
void Menu_SetVolume(uint8_t Volume)
{
  snprintf(nostream_text.Lines[2], MENU_CONTROL_MAX_LINE_LEN, "Volume: %d%%", (uint8_t) (((uint16_t) Volume)*100/255));
  snprintf(streaming_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Volume: %d%%", (uint8_t) (((uint16_t) Volume)*100/255));
  snprintf(volume_text.Lines[0], MENU_CONTROL_MAX_LINE_LEN, "Volume: %d%%", (uint8_t) (((uint16_t) Volume)*100/255));
  Menu_Print();
}

/**
 * @brief Set Call State
 */
void Menu_SetCallState(char *pCallState)
{
  snprintf(call_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "%s", pCallState);
  Menu_Print();
}

/**
 * @brief Set Media State
 */
void Menu_SetMediaState(char *pMediaState)
{
  snprintf(media_text.Lines[0], MENU_CONTROL_MAX_LINE_LEN, "Media %s", pMediaState);
  Menu_Print();
}

/**
 * @brief Set Track Title
 */
void Menu_SetTrackTitle(uint8_t *pTrackTitle, uint8_t TrackNameLen)
{
  if (TrackNameLen <= 14)
  {
    snprintf(media_text.Lines[1], TrackNameLen +1, "%s", pTrackTitle);
  }
  else
  {
    char display_string[15];
    snprintf(display_string, 12, "%s", pTrackTitle);
    display_string[11] = '.';
    display_string[12] = '.';
    display_string[13] = '.';
    display_string[14] = '\0';
    snprintf(media_text.Lines[1], 15, "%s", display_string);
  }
  Menu_Print();
}

/**
 * @brief Add a scanned broadcast source to the device list
 */
void Menu_AddBroadcastSource(uint8_t AdvSID, uint8_t *pAddress, uint8_t AddressType, char *pDeviceName)
{
  uint8_t i;
  uint8_t duplicate = 0;
  for (i = 0; i < num_broadcast_sources; i++)
  {
    if (memcmp(a_broadcast_sources[i].Address, pAddress, 6u) == 0)
    {
      duplicate = 1;
    }
  }

  if (duplicate == 0 && num_broadcast_sources < MAX_NUM_BROADCAST_SOURCE)
  {
    UTIL_MEM_cpy_8(&a_broadcast_sources[num_broadcast_sources].Address[0], pAddress, 6u);
    a_broadcast_sources[num_broadcast_sources].AddressType = AddressType;
    a_broadcast_sources[num_broadcast_sources].AdvSID = AdvSID;

