STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_menu_cfg.c
    Menu_AddListEntry(p_broadcast_list_menu, pDeviceName, select_broadcast_action);

    if (num_broadcast_sources == 0)
    {
      Menu_SetActivePage(p_broadcast_list_menu);
      p_broadcast_list_menu->pReturnPage = (struct Menu_Page_t *) p_config_menu;
    }
    else
    {
      Menu_Print();
    }

    num_broadcast_sources++;
  }
}

/**
 * @brief Set the PA Sync page as active
 */
void Menu_SetPASyncPage(void)
{
  Menu_SetActivePage(p_pa_sync_menu);
}

/**
 * @brief Set the BIS Sync Page as active
 */
void Menu_SetBISSyncPage(void)
{
  Menu_SetActivePage(p_bis_sync_menu);
}

/**
 * @brief Set the Synchronized Page as active
 */
void Menu_SetBroadcastSyncedPage(char* pSamplerateText)
{
  snprintf(&broadcast_synced_text.Lines[1][0], MENU_CONTROL_MAX_LINE_LEN, "%s", pSamplerateText);
  p_broadcast_synced_menu->pIcon = &input_icon;
  Menu_SetActivePage(p_broadcast_synced_menu);
}

/**
 * @brief Set the Scanning Page as active
 */
void Menu_SetBroadcastScanPage(void)
{
  num_broadcast_sources = 0;
  Menu_ClearList(p_broadcast_list_menu);
  Menu_SetActivePage(p_broadcast_scan_menu);
}

/* Private Functions Definition --------------------------------------------- */

/**
 * @brief CSIP Conf Up Callback
 */
static void Menu_CSIP_Conf_Up(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] CSIP Conf Up\n");

  csip_conf_id = (csip_conf_id + 1) % (APP_CSIP_SET_MEMBER_SIZE + 1);

  switch (csip_conf_id)
  {
    case 0:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Headphones");
      break;
    }
    case 1:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Earbud Left");
      break;
    }
    case 2:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Earbud Right");
      break;
    }
    default:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Unknown Device");
    }
  }
  Menu_Print();
}

/**
 * @brief CSIP Conf Down Callback
 */
static void Menu_CSIP_Conf_Down(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] CSIP Conf Down\n");
  if (csip_conf_id > 0)
  {
    csip_conf_id--;
  }
  else
  {
    csip_conf_id = APP_CSIP_SET_MEMBER_SIZE;
  }

  switch (csip_conf_id)
  {
    case 0:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Headphones");
      break;
    }
    case 1:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Earbud Left");
      break;
    }
    case 2:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Earbud Right");
      break;
    }
    default:
    {
      snprintf(csip_config_text.Lines[1], MENU_CONTROL_MAX_LINE_LEN, "Unknown Device");
    }
  }
  Menu_Print();
}

/**
 * @brief Start Advertising Callback
 */
static void Menu_Start_Advertising(void)
{
  uint8_t status;
  uint16_t appearance;
  LOG_INFO_APP("[APP_MENU_CONF] Start Advertising\n");
  if (app_initialization_done == 0u)
  {

    TMAPAPP_Init(csip_conf_id);
    if (csip_conf_id > 0)
    {
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
      /* Register CSIS */
      status = CSIPAPP_RegisterCSIS(0,
                                    CSIP_SIRK_IS_NOT_OOB,
                                    0x01, /*0x00 : Encrypted, 0x01 : PlainText*/
                                    (uint8_t *)APP_SIRK,
                                    APP_CSIP_SET_MEMBER_SIZE,
                                    csip_conf_id);
      LOG_INFO_APP("Register Set Member rank %d/%d returns status 0x%02X\n",
                   csip_conf_id,
                   APP_CSIP_SET_MEMBER_SIZE,
                   status);
#endif /* (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u) */
      appearance = GAP_APPEARANCE_EARBUD;
    }
    else
    {
      appearance = GAP_APPEARANCE_HEADPHONES;
    }
    app_initialization_done = 1u;
    /* Remove Action buttons */
    p_csip_config_menu->ActionDown.ActionType = 0;
    p_csip_config_menu->ActionUp.ActionType = 0;
  }
  else
  {
    if (csip_conf_id > 0)
    {
      appearance = GAP_APPEARANCE_EARBUD;
    }
    else
    {
      appearance = GAP_APPEARANCE_HEADPHONES;
    }
  }

  /* Start Advertising */
  status = TMAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, appearance);
  LOG_INFO_APP("TMAPAPP_StartAdvertising() returns status 0x%02X\n",status);
  UTIL_TIMER_Create(&Advertising_Timer, ADVERTISING_TIMEOUT, UTIL_TIMER_ONESHOT, &Menu_Advertising_TimerCallback, 0);
  UTIL_TIMER_Start(&Advertising_Timer);
  UNUSED(status);
}
/**
 * @brief Start Advertising Callback
 */
static void Menu_Stop_Advertising(void)
{
  uint8_t status;
  LOG_INFO_APP("[APP_MENU_CONF] Stop Advertising\n");
  status = TMAPAPP_StopAdvertising();
  LOG_INFO_APP("TMAPAPP_StopAdvertising() returns status 0x%02X\n",status);
  UTIL_TIMER_Stop(&Advertising_Timer);
  UNUSED(status);
}

/**
 * @brief Volume Up Callback
 */
static void Menu_Volume_Up(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Volume+\n");
  TMAPAPP_VolumeUp();
}

/**
 * @brief Volume Down Callback
 */
static void Menu_Volume_Down(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Volume-\n");
  TMAPAPP_VolumeDown();
}

/**
 * @brief Volume Mute Callback
 */
static void Menu_Volume_Mute(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Volume Mute\n");
  TMAPAPP_ToggleMute();
}

/**
 * @brief Call Answer Callback
 */
static void Menu_Call_Answer(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Answer Call\n");
  TMAPAPP_AnswerCall();
}

/**
 * @brief Call terminate Callback
 */
static void Menu_Call_Terminate(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Terminate Call\n");
  TMAPAPP_TerminateCall();
}

/**
 * @brief Next Track Callback
 */
static void Menu_Media_NextTrack(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Next Track\n");
  TMAPAPP_NextTrack();
}

/**
 * @brief Play Pause Callback
 */
static void Menu_Media_PlayPause(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Play/Pause\n");
  TMAPAPP_PlayPause();
}

/**
 * @brief Previous track Callback
 */
static void Menu_Media_PreviousTrack(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Previous Track\n");
  TMAPAPP_PreviousTrack();
}

/**
 * @brief Disconnect Callback
 */
static void Menu_Disconnect(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Disconnect\n");
  TMAPAPP_Disconnect();
  Menu_SetActivePage(p_waitcon_menu);
}

/**
 * @brief Clear Security Database Callback
 */
static void Menu_ClearSecDB(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Clear Security DB\n");
  aci_gap_clear_security_db();
  Menu_SetActivePage(p_startup_menu);
}

