STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/app_menu_cfg.c
static void Menu_SelectBroadcast(uint8_t id)
{
  uint8_t status;
  LOG_INFO_APP("[APP_MENU_CONF] Selected device %d\n", id);

  status = TMAPAPP_SyncToPA(a_broadcast_sources[id].AdvSID,
                           &a_broadcast_sources[id].Address[0],
                           a_broadcast_sources[id].AddressType);
  LOG_INFO_APP("PBPAPP_SyncToPA() returns status 0x%02X\n",status);

  if (status == BLE_STATUS_SUCCESS)
  {
    Menu_SetPASyncPage();
  }
}

/**
 * @brief Start Broadcast Scan Callback
 */
static void Menu_StartBroadcastScan(void)
{
  uint8_t status;
  LOG_INFO_APP("[APP_MENU_CONF] Start Scanning\n");

  if (app_initialization_done == 0u)
  {

    TMAPAPP_Init(csip_conf_id);
    if (csip_conf_id > 0)
    {
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
      /* Register CSIS */
      status = CSIPAPP_RegisterCSIS(0,
                                    CSIP_SIRK_IS_NOT_OOB,
                                    0x01, /*0x00 : Encrypted, 0x01 : PlainText*/
                                    (uint8_t *)APP_SIRK,
                                    APP_CSIP_SET_MEMBER_SIZE,
                                    csip_conf_id);
      LOG_INFO_APP("Register Set Member rank %d/%d returns status 0x%02X\n",
                   csip_conf_id,
                   APP_CSIP_SET_MEMBER_SIZE,
                   status);
#endif /* (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u) */
    }
    app_initialization_done = 1u;
    /* Remove Action buttons */
    p_csip_config_menu->ActionDown.ActionType = 0;
    p_csip_config_menu->ActionUp.ActionType = 0;
  }
  num_broadcast_sources = 0;
  Menu_ClearList(p_broadcast_list_menu);
  /* Start Scanning */
  status = TMAPAPP_StartSink();
  LOG_INFO_APP("TMAPAPP_StartSink() returns status 0x%02X\n",status);
  UNUSED(status);
}

/**
 * @brief Stop Broadcast Scan Callback
 */
static void Menu_StopBroadcastScan(void)
{
  uint8_t status;
  LOG_INFO_APP("[APP_MENU_CONF] Stop Scanning\n");
  status = TMAPAPP_StopSink();
  LOG_INFO_APP("TMAPAPP_StopSink() returns status 0x%02X\n",status);
  UNUSED(status);
}

/**
 * @brief Stop Broadcast Sync Callback
 */
static void Menu_StopBroadcastSync(void)
{
  LOG_INFO_APP("[APP_MENU_CONF] Stop Sync\n");
  num_broadcast_sources = 0;
  Menu_ClearList(p_broadcast_list_menu);
  TMAPAPP_StopSink();
  Menu_SetActivePage(p_broadcast_scan_menu);
}

/**
 * @brief Advertising Timer Callback
 */
static void Menu_Advertising_TimerCallback(void *arg)
{
  LOG_INFO_APP("[APP_MENU_CONF] Timer Expired, stop advertising\n");
  Menu_SetStartupPage();
  Menu_Stop_Advertising();
}

#if (CFG_JOYSTICK_SUPPORTED == 1)
/**
 * @brief Startup Timer Callback
 */
static void Menu_Startup_TimerCallback(void *arg)
{
  LOG_INFO_APP("[APP_MENU_CONF] Startup timer expired, Display home\n");
  Menu_SetStartupPage();
}
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
